<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Emotions.mlmodelc/analytics/coremldata.bin</key>
		<data>
		kYYRmk2vyt9uA6CNjEb9FqYmSA8=
		</data>
		<key>Resources/Emotions.mlmodelc/coremldata.bin</key>
		<data>
		lgFOXTjP0Q3Hw9uU96FrWL52tqI=
		</data>
		<key>Resources/Emotions.mlmodelc/metadata.json</key>
		<data>
		3fHUKvMmX+vEhdjlsmXZ1mg0vWo=
		</data>
		<key>Resources/Emotions.mlmodelc/model.espresso.net</key>
		<data>
		46d0m3HdPMwOYG/kAAiLnaquMo8=
		</data>
		<key>Resources/Emotions.mlmodelc/model.espresso.shape</key>
		<data>
		Bt5+o3TEhpd7+ev1HgBhVwBUlB0=
		</data>
		<key>Resources/Emotions.mlmodelc/model.espresso.weights</key>
		<data>
		Eh7ShQZlVojQvAf9xllIaxAN2SE=
		</data>
		<key>Resources/Emotions.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>Resources/Emotions.mlmodelc/model/coremldata.bin</key>
		<data>
		3mqrPVk/Gejzbw2T7DWXQ48QbmY=
		</data>
		<key>Resources/Emotions.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Resources/MoodMe.cer</key>
		<data>
		hpbQcPVqxENXiT4QeoCdeJSJay8=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Resources/Emotions.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			4IYIxDCc8Aes4o/bthOpAf9ektsATEQXcDwE2RIzdTY=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			BPlbcJqBiKyS9kmZwkGNgmEP9Cb3KiT8UKHqz4fnqpc=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			DcL+4Km8noF363y17h14yU90jcVkltV/gcXp9X3YWJ8=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			JGz6L0tx+t5lcyoh1Oj9TPo4op0ruPXYKkV/AJ0kodg=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			rJi0R2LPY/AhVJPqtDA8s8W3jHXfJomXBU5BiEGnACI=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			m9iHbiG3qxCZGsFksCW68COHoMwWQ06nd1SCKS55/Zo=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/model.rank.info.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+KWibjBW62+wbe6z28z9iK50kAIAyYxwtZZru37J1N4=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			YJhjTvVMB99nHqzjMk9XH7vyA8ZC9SiNTUWkFbBXCvQ=
			</data>
		</dict>
		<key>Resources/Emotions.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Resources/MoodMe.cer</key>
		<dict>
			<key>hash2</key>
			<data>
			FlMAjCILSZs3wIDvYjj8d9PsiSbjKjYONMW/w9BHUkc=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
